---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ViewSheetFailures.ViewportCantContainEmptyView
source: html/10d5a391-7b93-07e1-b295-d87350f991a5.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ViewSheetFailures.ViewportCantContainEmptyView Property

Sheet views cannot contain empty view "%1!s!".

## Syntax (C#)
```csharp
public static FailureDefinitionId ViewportCantContainEmptyView { get; }
```